Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
a=[4,8,15,16,23,42]
pd.Series(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
a=[1,2,3,4,5,6,7,8,9,0]
pd.Series(a)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [11]:
a={'name':('alice','bob','claire'),
   'age':[20,30,40]}
pd.DataFrame(a)

     name  age
0   alice   20
1     bob   30
2  claire   40

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [78]:
#Dataframe means data in tabular format while series means if we select only one column from dataframe it will become a series
a={'name':('alice','bob','claire'),
   'age':[20,30,40]}
df=pd.DataFrame(a)

In [37]:
df #dataframe

     name  age
0   alice   20
1     bob   30
2  claire   40

In [16]:
df['name'] #series

0     alice
1       bob
2    claire
Name: name, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ans drop(),renam(),iloc(),loc(),head(),sort(),fillna()

In [20]:
df

     name  age
0   alice   20
1     bob   30
2  claire   40

In [23]:
df.iloc[1,:]

name    bob
age      30
Name: 1, dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

 an object or variable is said to be mutable if its state or value can be changed after it is created.

In [45]:
df.loc[df['name'] == 'alice', 'name'] = 'aryan'

In [46]:
df

     name  age
0   aryan   20
1     bob   30
2  claire   40

Series and Dataframe are mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [81]:
#method1
df2=df['age']
df1=df['name']
pd.DataFrame((df1,df2)).T

     name age
0   alice  20
1     bob  30
2  claire  40

In [77]:
#method2
import pandas as pd

# Creating two Series
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])

# Combining the Series into a dictionary
data = {'Name': names, 'Age': ages}

# Creating a DataFrame from the dictionary
df = pd.DataFrame(data)

# Displaying the DataFrame
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35